In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('sales.csv')
df

   SaleID Region  Amount        Date
0       1  North     500  2024-01-01
1       2  South     300  2024-02-15
2       3  North     700  2024-03-10
3       4   West     400  2024-01-20
4       5  South    1000  2024-03-25

In [3]:
#Amount > 500
amount_500 = df[df['Amount'] > 500]
amount_500

   SaleID Region  Amount        Date
2       3  North     700  2024-03-10
4       5  South    1000  2024-03-25

In [4]:
#Region is 'North"
north = df[df['Region'] == 'North']
north

   SaleID Region  Amount        Date
0       1  North     500  2024-01-01
2       3  North     700  2024-03-10

In [5]:
#amount>500andRegion=North
a500_north = df[(df['Amount'] > 500) & (df['Region'] == 'North')]
a500_north

   SaleID Region  Amount        Date
2       3  North     700  2024-03-10

In [8]:
def add_discount(amount):
    if amount > 700:
        return 0.9*amount
    else:
        return amount

df['DiscountedAmount'] = df['Amount'].apply(add_discount)

In [9]:
df

   SaleID Region  Amount        Date  DiscountedAmount
0       1  North     500  2024-01-01             500.0
1       2  South     300  2024-02-15             300.0
2       3  North     700  2024-03-10             700.0
3       4   West     400  2024-01-20             400.0
4       5  South    1000  2024-03-25             900.0

In [11]:
sales_by_region = df.groupby('Region')['Amount'].sum()
avg_sales_by_region = df.groupby('Region')['Amount'].mean()
print(f"Total sales by region:\n{sales_by_region}\nAvg sales by region:\n{avg_sales_by_region}")

Total sales by region:
Region
North    1200
South    1300
West      400
Name: Amount, dtype: int64
Avg sales by region:
Region
North    600.0
South    650.0
West     400.0
Name: Amount, dtype: float64

In [34]:
total_sum = df['Amount'].sum()
#total_sum #2900
region_pct = (sales_by_region / total_sum) * 100
region_pct_df = region_pct.reset_index()
region_pct_df.columns = ['Region', 'Pct_Sales']
region_pct_df

  Region  Pct_Sales
0  North  41.379310
1  South  44.827586
2   West  13.793103

In [32]:
df = df.drop(['Region_Pct_Sales', 'Pct_Sales_y', 'Pct_Sales_x'], axis=1)

In [35]:
df = df.merge(region_pct_df, on='Region', how='left')

df

   SaleID Region  Amount        Date  DiscountedAmount  Pct_Sales
0       1  North     500  2024-01-01             500.0  41.379310
1       2  South     300  2024-02-15             300.0  44.827586
2       3  North     700  2024-03-10             700.0  41.379310
3       4   West     400  2024-01-20             400.0  13.793103
4       5  South    1000  2024-03-25             900.0  44.827586